import type { Card } from '../../../interfaces/Quiz.interfaces.ts'

const localCards: { [key: string]: Card } = {
	"1": {
		id: 1,
		quiz: [
			{
				"title": "Что представляла собой Киевская Русь?",
				"variants": ["Государство", "Империя", "Княжество", "Королевство"],
				"correct": 2
			},
			{
				"title": "Кто был первым князем Киевской Руси?",
				"variants": ["Владимир Святославич", "Рюрик", "Олег", "Ярослав Мудрый"],
				"correct": 1
			},
			{
				"title": "Какое событие считается началом истории Киевской Руси?",
				"variants": ["Крещение Руси", "Битва на Калке", "Великая Отечественная война", "Падение Киева"],
				"correct": 0
			},
			{
				"title": "Какая религия была принята в Киевской Руси в конце X века?",
				"variants": ["Христианство", "Иудаизм", "Ислам", "Язычество"],
				"correct": 0
			},
			{
				"title": "Какой князь провел крещение Руси?",
				"variants": ["Олег", "Ярослав Мудрый", "Владимир Великий", "Святослав"],
				"correct": 2
			},
		]
	},
	"2": {
		id: 2,
		quiz: [
			{
				"title": "Какой город стал первой столицей Киевской Руси?",
				"variants": ["Новгород", "Переяславль", "Смоленск", "Киев"],
				"correct": 3
			},
			{
				"title": "Кто из князей считается основателем династии Рюриковичей?",
				"variants": ["Рюрик", "Олег", "Владимир Великий", "Ярослав Мудрый"],
				"correct": 0
			},
			{
				"title": "Какое важное событие объединило Киевскую Русь?",
				"variants": ["Сложение князей под общую власть", "Заключение Варяжского договора", "Крещение Руси", "Поход на Изморье"],
				"correct": 0
			}
		],
	},
};

export default localCards;